{
  "architectures": [
    "GraniteMoeHybridForCausalLM"
  ],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "attention_multiplier": 0.015625,
  "bos_token_id": 100257,
  "dtype": "bfloat16",
  "embedding_multiplier": 12,
  "eos_token_id": 100257,
  "hidden_act": "silu",
  "hidden_size": 1024,
  "init_method": "mup",
  "initializer_range": 0.1,
  "intermediate_size": 2048,
  "layer_types": [
    "attention",
    "attention",
    "attention",
    "attention",
    "attention",
    "attention",
    "attention",
    "attention",
    "attention",
    "attention",
    "attention",
    "attention",
    "attention",
    "attention",
    "attention",
    "attention",
    "attention",
    "attention",
    "attention",
    "attention",
    "attention",
    "attention",
    "attention",
    "attention",
    "attention",
    "attention",
    "attention",
    "attention"
  ],
  "logits_scaling": 4,
  "mamba_chunk_size": 256,
  "mamba_conv_bias": true,
  "mamba_d_conv": 4,
  "mamba_d_head": 16,
  "mamba_d_state": 256,
  "mamba_expand": 2,
  "mamba_n_groups": 1,
  "mamba_n_heads": 128,
  "mamba_proj_bias": false,
  "max_position_embeddings": 32768,
  "model_type": "granitemoehybrid",
  "normalization_function": "rmsnorm",
  "num_attention_heads": 16,
  "num_experts_per_tok": 0,
  "num_hidden_layers": 28,
  "num_key_value_heads": 4,
  "num_local_experts": 0,
  "output_router_logits": false,
  "pad_token_id": 100256,
  "position_embedding_type": "rope",
  "residual_multiplier": 0.263,
  "rms_norm_eps": 1e-05,
  "rope_parameters": {
    "rope_theta": 10000000,
    "rope_type": "default"
  },
  "router_aux_loss_coef": 0.01,
  "shared_intermediate_size": 2048,
  "tie_word_embeddings": true,
  "time_step_limit": [
    0.0,
    {
      "__float__": "Infinity"
    }
  ],
  "time_step_max": 0.1,
  "time_step_min": 0.001,
  "transformers_version": "5.3.0",
  "use_cache": false,
  "vocab_size": 100352
}
