{
  "add_prefix_space": false,
  "backend": "tokenizers",
  "bos_token": "<|end_of_text|>",
  "clean_up_tokenization_spaces": false,
  "eos_token": "<|end_of_text|>",
  "errors": "replace",
  "is_local": false,
  "model_max_length": 1000000000000000019884624838656,
  "pad_token": "<|pad|>",
  "padding_side": "left",
  "tokenizer_class": "GPT2Tokenizer",
  "unk_token": "<|unk|>"
}
